BASE_ADMIN_LEXICON_RU = {
    "main_admin_menu":
        "Главное меню управления ботом.\n\nВыберите интересующую функцию.",
    "fetched_places": "<b>Места просмотров</b>\n",
    "add_watching_place": "Введите название места сбора ...",
    "show_nearest_watching_days": "Показаны ближайшие запланированные встречи"
}

ERROR_ADMIN_LEXICON_RU = {
    "error_show_users":
        "Не удалось получить пользователей. Повторите позднее или обратитесь к организаторам",
    "error_show_places":
        "Не удалось получить места просмотров. Повторите позднее или обратитесь к организаторам",
    "error_adding_watching_place":
        "Не удалось добавить место просмотра. Повторите позднее или обратитесь к организаторам",
    "error_show_nearest_watching_days":
        "Не удалось получить ближайшие встречи. Повторите позднее или обратитесь к организаторам"
}
