BASE_ADMIN_LEXICON_RU = {
    "main_admin_menu": """🔐 Панель администратора\nДоступные функции:""",
    "fetched_places": "<b>Места просмотров</b>\n",
    "add_watching_place": "Введите название места сбора ...",
    "show_nearest_watching_days": "Показаны ближайшие запланированные встречи",
    "edit_place_process": "Выберите действие с выбранным местом",
    "edit_place_name_process": "Введите новое название места",
    "edit_place_name": "Изменено место на {new_place_name}",
    "edit_address_place_process": "Введите новый адрес места",
    "edit_place_address": "Изменен адрес по new_place_address}",
    "delete_place": "Место удалено",
    "start_meeting_poll": "Опрос отправлен",
    "process_go_button": "<b>Выберите новое место просмотра</b>\n",
    "change_watch_place_process": "Место для встречи изменено",
    "process_cancel_meeting": "Запланированная встреча успешно отменена!",
    "process_show_visitors": "Показаны участники встречи\n{users_string}",
}

ERROR_ADMIN_LEXICON_RU = {
    "error_show_users": "Не удалось получить пользователей. Повторите позднее или обратитесь к организаторам",
    "error_show_places": "Не удалось получить места просмотров. Повторите позднее или обратитесь к организаторам",
    "error_adding_watching_place": "Не удалось добавить место просмотра. Повторите позднее или обратитесь к организаторам",
    "error_show_nearest_watching_days": "Не удалось получить ближайшие встречи. Повторите позднее или обратитесь к организаторам",
    "error_input_place_name": "Не удалось вписать название места. Повторте позднее или обратитесь к организаторам",
    "error_input_place_address": "Не удалось вписать адрес места. Повторите позднее или обратитесь к организаторам",
    "failed_edit_place_process": "Не удалось изменить место встерчи. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_name_process": "Не удалось изменить название места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_name": "Не удалось изменить название места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_address_place_process": "Не удалось изменить адрес места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_address": "Не удалось изменить адрес места. Повторте позднее или обратитесь к организаторам",
    "failed_delete_place": "Не удалось удалить место встречи. Повторте позднее или обратитесь к организаторам",
    "failed_process_scheduled_match_days_filter": "Не удалось получить ближайшие матчи. Повторте позднее или обратитесь к организаторам",
    "failed_start_meeting_poll": "Не удалось запустить опрос. Повторте позднее или обратитесь к организаторам",
    "failed_process_go_button": "Не удалось обработать нажатие кнопки ИДУ. Повторте позднее или обратитесь к организаторам",
    "failed_change_watch_place_process": "Не удалось изменить место встречи. Повторте позднее или обратитесь к организаторам",
    "failed_process_cancel_meeting": "Не удалось отменить запланированную встречу. Повторте позднее или обратитесь к организаторам",
    "failed_process_show_visitors": "Не удалось получить зарегистрированных на встречу пользователей. Повторте позднее или обратитесь к организаторам",
}

ADMIN_MATCH_INVITE_POLL_OPTIONS = {"agree": "Иду", "cancel": "Не иду"}


ADMIN_WATCH_DAY_HANDLER_LEXICON_RU = {
    "add_watch_day": "Выберите матч",
    "choose_place": "Выберите место просмотра",
    "registrate_meeting": "Встреча добавлена",
    "no_nearest_matches": "Нет ближайших матчей",
}


# TODO: Разобраться с лексикой ощибок
ADMIN_WATCH_DAY_HANDLER_ERROR_LEXICON_RU = {
    "add_watch_day_error": "К сожаленю ошибка. Повторите позднее или обратитесь к организаторам",
    "choose_place_error": "Выберите место просмотра",
    "registrate_meeting_error": "Встреча добавлена",
    "watch_day_register_error": "К сожаленю ошибка. Повторите позднее или обратитесь к организаторам",
}
