BASE_ADMIN_LEXICON_RU = {
    "main_admin_menu":
        "Главное меню управления ботом.\n\nВыберите интересующую функцию.",
    "fetched_places": "<b>Места просмотров</b>\n",
    "add_watching_place": "Введите название места сбора ...",
    "show_nearest_watching_days": "Показаны ближайшие запланированные встречи",
    "edit_place_process": "Выберите действие с выбранным местом",
    "edit_place_name_process": "Введите новое название места",
    "edit_place_name": "Изменено место на {new_place_name}",
    "edit_address_place_process": "Введите новый адрес места",
    "edit_place_address": "Изменен адрес по new_place_address}",
    "delete_place": "Место удалено"

}

ERROR_ADMIN_LEXICON_RU = {
    "error_show_users":
        "Не удалось получить пользователей. Повторите позднее или обратитесь к организаторам",
    "error_show_places":
        "Не удалось получить места просмотров. Повторите позднее или обратитесь к организаторам",
    "error_adding_watching_place":
        "Не удалось добавить место просмотра. Повторите позднее или обратитесь к организаторам",
    "error_show_nearest_watching_days":
        "Не удалось получить ближайшие встречи. Повторите позднее или обратитесь к организаторам",
    "error_input_place_name":
        "Не удалось вписать название места. Повторте позднее или обратитесь к организаторам",
    "error_input_place_address":
        "Не удалось вписать адрес места. Повторите позднее или обратитесь к организаторам",
    "failed_edit_place_process":
        "Не удалось изменить место встерчи. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_name_process":
        "Не удалось изменить название места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_name":
        "Не удалось изменить название места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_address_place_process":
        "Не удалось изменить адрес места. Повторте позднее или обратитесь к организаторам",
    "failed_edit_place_address":
        "Не удалось изменить адрес места. Повторте позднее или обратитесь к организаторам",
    "failed_delete_place":
        "Не удалось удалить место встречи. Повторте позднее или обратитесь к организаторам"
}
