BASE_LEXICON_RU = {
    "/start": """🔴 Привет, настоящий фанат Manchester United! 🔴\n
Этот бот поможет тебе быть в курсе всех встреч фан-сообщества, новостей и событий. Выбирай нужный раздел ниже! ⬇️""",

    "scheduled_match_days_header": "📅 **Ближайшие матчи Manchester United**  ",

    "scheduled_match_days_footer": "ℹ️ Хочешь присоединиться к просмотру? Выбери встречу ниже! ⬇️",

    "nearest_meetings_footer": """Вот ближайшие встречи фанатов Manchester United. Выбирай и присоединяйся!\n
👇 **Доступные просмотры:** """,

    "has_no_nearest_meetings": """Сейчас у Manchester United нет запланированных матчей.\n 
Возможно, это межсезонье или расписание еще не обновлено.\nСледи за новостями — скоро будет жарко! 🔴⚽""",
}

BASE_ERROR_LEXICON_RU = {
    "internal_error": """📉 Ошибка загрузки... Прямо как наш midfield в том сезоне!
Шутки шутками, но мы уже разбираемся. Обновите бота через пару минут! 🔧"""
}
