MAIN_KEYBOARD_BUTTON_LEXICON_RU = {
    "scheduled_match_days": "📅 **Ближайшие матчи Manchester United**  ",
    "nearest_meetings": "🎥 **Какой матч смотрим?**  ",
    "back_to_main_menu": "⬅️ **Назад в меню**  ",
}

ADMIN_KEYBOARD_BUTTON_LEXICON_RU = {
    "fan_list": "👥 **Список пользователей**",
    "nearest_meetings": "📅 **Админ-панель: Ближайшие просмотры**",
    "places": "📍 **Список мест для просмотров**",
    "add_place": "➕ **Добавление новой локации**",
    "back_to_main_menu": "⬅️ **Назад в меню**  ",
}

ADMIN_WATCH_DAY_KEYBOARD_BUTTON_LEXICON_RU = {
    "add_watch_day": "➕ Создать встречу",
    "start_meeting_poll": "📢 Анонсировать в чат",
    "show_visitors": "👥 Показать участников",
    "cancel_meeting": "❌ Отменить встречу",
    "edit_watch_place": "✏️ Изменить локацию",
    "back_to_main_menu": "⬅️ **Назад в меню**  ",
}