CUSTOMER_LEXICON_RU = {
    "approve_invitation": "Супер! Ждем\nGG MU!",
    "cancel_invitation": "Очень жаль. Увидимся в следующий раз",
    "first_cancel_invitation": "Жаль...\nУвидимся в следующий раз!",
    "first_approve_invitation": "Вы зарегистрировались на матч"
}

CUSTOMER_ERROR_LEXICON_RU = {
    "error_approve_invitation":
        "Не получилось зарегистировать на просмотр. Повторите позднее или обратитесь к организаторам",
    "error_cancel_invitation":
        "Не получилось отменить регистрацию на просмотр. Повторите позднее или обратитесь к организаторам",
    "error_fetching_scheduled_match_days":
        "Не удалось получить запланированные матчи. Повторите позднее или обратитесь к организаторам",
    "error_first_approve_invitation":
        "Вы уже зарегистрировались на матч, ждем вас. Либо ошибка на сервере, повторите позднее",
    "error_first_cancel_invitation":
        "Не удалось отменить регистрацию на просмотр. Повторите позднее или обратитесь к организаторам"
}