USER_REGISTRATION_LEXICON_RU = {
    "add_birthday_date": "🎂 Укажите ваш день рождения (ДД.ММ.ГГГГ)",
    "add_fan_start_date": "🔴 С какого года вы болеете за Manchester United?\nУкажите 4 цифры года",
    "add_favorite_player": "⭐ Назовите вашего любимого игрока:\n(нынешнего или легенду клуба)",
    "finish_registration": "🔴⚪ *Добро пожаловать в семью Red Devils!* ⚪🔴\n\nТеперь вы часть нашего сообщества!\nДоступ открыт ко всем фан-встречам.\n\n#GGMU #MUFC",
}

USER_REGISTRATION_ERROR_LEXICON_RU = {
    "internal_error": "⚠️ *Ошибка регистрации*\n\nСистема временно недоступна.\nПопробуйте через 5 минут.\n\nЕсли проблема сохраняется:\n@ManUtdSupportBot"
}
